Repository: Khanh12894/CamsKhanh
Catalog: Cams.WebApi/Resources/WsResource.*.resx
Languages: vi

# access_denied
source: The resource owner or authorization server denied the request.
vi: Chủ sở hữu tài nguyên hoặc máy chủ ủy quyền đã từ chối yêu cầu.

# invalid_client
source: Client authentication failed, such as if the request contains an invalid client ID or secret.
vi: Xác thực ứng dụng khách không thành công.

# invalid_credential
source: The username or password you entered is incorrect.
vi: Tên người dùng hoặc mật khẩu bạn nhập không đúng.

# invalid_grant
source: The username or password you entered is incorrect.
vi: Tên người dùng hoặc mật khẩu bạn nhập không đúng.

# invalid_grant1
source: Authorization Code expired
vi: Mã xác thực đã hết hạn.

# invalid_request
source: Parameters missing, invalid parameter value provided, or parameters might be duplicates.
vi: Thiếu tham số, giá trị tham số được cung cấp không hợp lệ hoặc trùng tham số.

# invalid_scope
source: Scope is missing or not well-defined
vi: Phạm vi bị thiếu hoặc không được xác định rõ.

# invalid_token
source: No access token provided
vi: Không có mã thông báo truy cập được cung cấp.

# server_error
source: Internal server error that can be used when a 500 error cannot be returned to the client.
vi: Lỗi máy chủ nội bộ.

# temporarily_unavailable
source: The server is currently unable to handle the request. Can be used in redirect scenarios where a 503 cannot be returned.
vi: Máy chủ hiện không thể xử lý yêu cầu.

# unauthorized_client
source: Malformed request.
vi: Yêu cầu không đúng.

# unsupported_response_type
source: The authorization server does not support obtaining an authorization code using this method.
vi: Máy chủ xác thực không hỗ trợ lấy mã xác thực bằng phương pháp này.

# DefaultError
source: An unknown failure has occurred.
vi: Một lỗi chưa xác định đã xảy ra.

# ConcurrencyFailure
source: Optimistic concurrency failure, object has been modified.
vi: VI - Optimistic concurrency failure, object has been modified.

# PasswordMismatch
source: Incorrect password.
vi: Tài khoản hoặc mật khẩu không đúng.

source: Invalid token.
vi: VI - Token không hợp lệ.

# LoginAlreadyAssociated
source: A user with this login already exists.
vi: VI - Một người dùng có thông tin đăng nhập này đã tồn tại.

# InvalidUserName
source: User name 'userName' is invalid, can only contain letters or digits.
vi: VI - Tên người dùng không hợp lệ, chỉ có thể chứa các chữ cái hoặc chữ số.

# InvalidEmail
source: Email 'email' is invalid.
vi: Tài khoản hoặc mật khẩu không đúng.

# DuplicateUserName
source: User Name 'userName' is already taken.OK
vi: Tên truy cập '{userName}' đã tồn tại. Hãy chọn tên truy cập khác.

# DuplicateEmail
source: Email 'email' is already taken.
vi: VI - Email đã được sử dụng.

# InvalidRoleName
source: Role name 'role' is invalid.
vi: Tên vai trò không hợp lệ.

# DuplicateRoleName
source: Role name 'role' is already taken.
vi: VI - Tên vai trò đã được sử dụng.

# UserAlreadyHasPassword
source: User already has a password set.
vi: VI - Người dùng đã có mật khẩu được đặt.

# UserLockoutNotEnabled
source: Lockout is not enabled for this user.
vi: VI - Khóa không được kích hoạt cho người dùng này.

# UserAlreadyInRole
source: User already in role 'role'.
vi: VI - Người dùng đã ở trong vai trò.

# UserNotInRole
source: User is not in role 'role'.
vi: VI - Người dùng không ở trong vai trò.

# PasswordTooShort
source: Passwords must be at least length characters.
vi: VI - Mật khẩu quá ngắn.

# PasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character.
vi: VI - Mật khẩu phải bao gồm ký tự đặc biệt.

# PasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9').
vi: VI - Mật khẩu phải bao gồm chữ số.

# PasswordRequiresLower
source: EN - Passwords must have at least one lowercase ('a'-'z').
vi: VI - Mật khẩu phải bao gồm chữ viết thường.

# PasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z').
vi: VI - Mật khẩu phải bao gồm chữ viết thường.

source: Error Generic
vi: Lỗi Chung.

# required_field
source: This field is required.
vi: Vui lòng nhập giá trị

# ErrorParamId
source: {0} is incorrect
vi: {0} không hợp lệ.

# ErrorProcessing
source: Error in processing
vi: Có lỗi trong quá trình xử lý.

# required_number
source: This field is required number
vi: Giá trị nhập vào phải là số.

# invalid_value
source: Invaid value
vi: Giá trị không hợp lệ.

# ErrorRequirementForVoucher
source: Can't create voucher, please check again!
vi: Thông tin yêu cầu của bạn hiện tại không cho phép tạo mới phiếu nhập/xuất.

# ErrorStatusInvalid
source: Status invalid for action
vi: Trạng thái bản ghi không cho phép thực hiện thao tác này.

# ErrorQuantityAndAmount
source: Please check quantity
vi: Số lượng cập nhật hiện tại không hợp lệ.

# IsUsed
source: This recored used
vi: Bản ghi này đang được sử dụng nên không thể xóa.

# CanNotDelete
source: Can't delete
vi: Bản ghi này không xóa được.

# ErrorFileNotFound
source: File not found
vi: Không tìm thấy file.

# UserWasLocked
source: Your account was locked by admin
vi: Tài khoản của bạn đang bị tạm khóa
